In [138]:
import pandas as pd

In [160]:
Person = {
    "Name" : ["Jason","Larry"],
    "Age" : ["20","15"],
    "Gender" : ["Male","Male"]
}

In [161]:
Person["Name"]

['Jason', 'Larry']

In [162]:
frame = pd.DataFrame(Person)

In [163]:
frame

    Name Age Gender
0  Jason  20   Male
1  Larry  15   Male

In [169]:
frame = frame.reset_index(drop = True)
frame
# to get rid of the index column...

   index   Name Age Gender
0      0  Jason  20   Male
1      1  Larry  15   Male

In [172]:
frame1 = pd.DataFrame(Person)
frame1 = frame1.set_index('Name')
frame1

      Age Gender
Name
Jason  20   Male
Larry  15   Male

In [173]:
df1 = pd.DataFrame.from_dict({
    'Name': ['Jane', 'Nik', 'Kate', 'Melissa', 'Evan', 'Doug', 'Joe'],
    'Age': [10, 35, 34, 23, 70, 55, 89],
    'Height': [130, 178, 155, 133, 195, 150, 205],
    'Weight': [80, 200, 220, 150, 140, 95, 180]
}).set_index('Name')
# creating a dataframe directly from pandas using a dictionary

In [174]:
df1

         Age  Height  Weight
Name
Jane      10     130      80
Nik       35     178     200
Kate      34     155     220
Melissa   23     133     150
Evan      70     195     140
Doug      55     150      95
Joe       89     205     180

In [179]:
df1.loc["Jane":"Evan" , ['Weight' , 'Age']]

         Weight  Age
Name
Jane         80   10
Nik         200   35
Kate        220   34
Melissa     150   23
Evan        140   70

In [181]:
person = {
    "Name" : "Jason",
    "Age" : 20,
    "Gender" : "Male"
}